#pragma once
#include "EnumCallbacks.h"

NTKERNELAPI NTSTATUS ObReferenceObjectByName(
	IN PUNICODE_STRING ObjectName,
	IN ULONG Attributes,
	IN PACCESS_STATE PassedAccessState OPTIONAL,
	IN ACCESS_MASK DesiredAccess OPTIONAL,
	IN POBJECT_TYPE ObjectType,
	IN KPROCESSOR_MODE AccessMode,
	IN OUT PVOID ParseContext OPTIONAL,
	OUT PVOID* Object
);

CALLBACK_LOOKUP_TABLE g_CallbackTable = { 0 };

PVOID FindPspCreateProcessNotifyRoutine()
{
	UNICODE_STRING PsSetCreateProcessNotifyRoutineName = RTL_CONSTANT_STRING(L"PsSetCreateProcessNotifyRoutine");
	PVOID PsSetCreateProcessNotifyRoutineAddr = MmGetSystemRoutineAddress(&PsSetCreateProcessNotifyRoutineName);
	if (NULL == PsSetCreateProcessNotifyRoutineAddr)
	{
		DbgPrint("PsSetCreateProcessNotifyRoutineAddr is NULL");
		return NULL;
	}
	DbgPrint("PsSetCreateProcessNotifyRoutineAddr: %p", PsSetCreateProcessNotifyRoutineAddr);
	//4c8d2d
	// ---------------------------------------------------
	// LyShark 开始定位特征

	// 设置起始位置
	PUCHAR StartSearchAddress = (PUCHAR)PsSetCreateProcessNotifyRoutineAddr;

	// 设置搜索长度
	ULONG size = 0x20;

	// 指定特征码
	UCHAR pSpecialCode[256] = { 0 };

	// 指定特征码长度
	ULONG ulSpecialCodeLength = 1;

	pSpecialCode[0] = 0xe8;

	// 开始搜索,找到后返回首地址
	PVOID result = SearchSpecialCode1(StartSearchAddress, size, pSpecialCode, ulSpecialCodeLength);
	if (NULL == result)
	{
		DbgPrint("PspSetCreateProcessNotifyRoutineAddr is NULL");
		// 打印前30字节

		return STATUS_INSUFFICIENT_RESOURCES;
	}

	// 初始化并获取自旋锁
	KSPIN_LOCK mySpinLock;
	KeInitializeSpinLock(&mySpinLock);
	KIRQL oldIrql;
	KeAcquireSpinLock(&mySpinLock, &oldIrql);

	// 检查 MDL 大小是否足够
	if (MmGetMdlByteCount(pMdl) < ulShellcodeLength) {
		DbgPrint("memcpy skipped: MmGetMdlByteCount(pMdl) < ulShellcodeLength");
		status = STATUS_BUFFER_TOO_SMALL;
		goto Cleanup;
	}

	__try {
		if (Status) {
			memcpy(OldCode, pVoid, ulShellcodeLength);
			memcpy(pVoid, pShellcode, ulShellcodeLength);
                
        }
		else
		{
			// 恢复原始代码
			memcpy(pVoid, OldCode, ulShellcodeLength);
		}
	}
	__except (EXCEPTION_EXECUTE_HANDLER) {
		DbgPrint("ControlCallback except.status: %X", GetExceptionCode());
		status = GetExceptionCode();
	}

	Cleanup:

	// 释放自旋锁
	KeReleaseSpinLock(&mySpinLock, oldIrql);

	// 取消映射并释放 MDL
	MmUnmapLockedPages(pVoid, pMdl);
	IoFreeMdl(pMdl);

	return status;
}

ULONG EnumMiniFilter(PMINIFILTER_OBJECT Array)
{
	ULONG maxNum = 64;
	ULONG ulFilterListSize = 0;
	PFLT_FILTER* ppFilterList = NULL;
	ULONG i = 0;
	NTSTATUS status = STATUS_SUCCESS;
	LONG lOperationsOffset = 0;
	PFLT_OPERATION_REGISTRATION pFltOperationRegistration = NULL;

	// 获取 Minifilter 过滤器Filter 的数量
	FltEnumerateFilters(NULL, 0, &ulFilterListSize);

	// 申请内存
	ppFilterList = (PFLT_FILTER*)ExAllocatePool2(POOL_FLAG_NON_PAGED, ulFilterListSize * sizeof(PFLT_FILTER), 'cbin');
	if (NULL == ppFilterList)
	{
		DbgPrint("ExAllocatePool2 failed");
		return 0;
	}

	// 获取 Minifilter 中所有过滤器Filter 的信息
	status = FltEnumerateFilters(ppFilterList, ulFilterListSize, &ulFilterListSize);
	if (!NT_SUCCESS(status))
	{
		DbgPrint("FltEnumerateFilters failed, status: 0x%X", status);
		ExFreePoolWithTag(ppFilterList, 'cbin');
		return 0;
	}

	DbgPrint("过滤器数量: %d \n", ulFilterListSize);

	// 获取 PFLT_FILTER 中 Operations 偏移
	RTL_OSVERSIONINFOEXW OSVersion = { 0 };
	OSVersion.dwOSVersionInfoSize = sizeof(RTL_OSVERSIONINFOEXW);
	RtlGetVersion((PRTL_OSVERSIONINFOW)&OSVersion);
	if (OSVersion.dwMajorVersion >= 10 && OSVersion.dwBuildNumber >= 26100) {
		// Windows 11及以上，使用对应偏移
		lOperationsOffset = 0x1B0;
		DbgPrint("win11");
	}
	else {
		// 旧版本偏移
		//lOperationsOffset = 0x1A8;
		DbgPrint("暂不支持的系统版本!");
		return 0;
	}

	if (!Array) {
		DbgPrint("无效Array!");
		return 0;
	}

	// 开始遍历 Minifilter
	for (i = 0; i < ulFilterListSize; i++)
	{
		// 获取 PFLT_FILTER 中 Operations 成员地址
		pFltOperationRegistration = (PFLT_OPERATION_REGISTRATION)(*(PVOID*)((PUCHAR)ppFilterList[i] + lOperationsOffset));

		__try
		{
			if (i > maxNum) { // 重新分配
				DbgPrint("过滤器数量过多，重新分配内存");
				PMINIFILTER_OBJECT pNewArray = (PMINIFILTER_OBJECT)ExAllocatePool2(POOL_FLAG_NON_PAGED, sizeof(MINIFILTER_OBJECT) * (maxNum + 64), 'mfin');
				if (pNewArray) {
					memcpy(pNewArray, Array, sizeof(MINIFILTER_OBJECT) * maxNum);
					ExFreePoolWithTag(Array, 'mfin');
					Array = pNewArray;
					maxNum += 64;
				}
				else {
					DbgPrint("重新分配内存失败");
					break;
				}
			}
			Array[i].hFilter = ppFilterList[i];
			/*
			lkd> dt fltmgr!_FLT_FILTER
			   +0x000 Base             : _FLT_OBJECT
			   +0x038 Frame            : Ptr64 _FLTP_FRAME
			   +0x040 Name             : _UNICODE_STRING
			   +0x050 DefaultAltitude  : _UNICODE_STRING
			   +0x060 Flags            : _FLT_FILTER_FLAGS
			   +0x068 DriverObject     : Ptr64 _DRIVER_OBJECT
			   +0x070 InstanceList     : _FLT_RESOURCE_LIST_HEAD
			   +0x0f0 VerifierExtension : Ptr64 _FLT_VERIFIER_EXTENSION
			   +0x0f8 VerifiedFiltersLink : _LIST_ENTRY
			   +0x108 FilterUnload     : Ptr64     long
			   +0x110 InstanceSetup    : Ptr64     long
			   +0x118 InstanceQueryTeardown : Ptr64     long
			   +0x120 InstanceTeardownStart : Ptr64     void
			   +0x128 InstanceTeardownComplete : Ptr64     void
			   +0x130 SupportedContextsListHead : Ptr64 _ALLOCATE_CONTEXT_HEADER
			   +0x138 SupportedContexts : [7] Ptr64 _ALLOCATE_CONTEXT_HEADER
			   +0x170 PreVolumeMount   : Ptr64     _FLT_PREOP_CALLBACK_STATUS
			   +0x178 PostVolumeMount  : Ptr64     _FLT_POSTOP_CALLBACK_STATUS
			   +0x180 GenerateFileName : Ptr64     long
			   +0x188 NormalizeNameComponent : Ptr64     long
			   +0x190 NormalizeNameComponentEx : Ptr64     long
			   +0x198 NormalizeContextCleanup : Ptr64     void
			*/
			//Array[i].Name = *(PUNICODE_STRING)((PUCHAR)ppFilterList[i] + 0x40);
			//Array[i].Altitude = *(PUNICODE_STRING)((PUCHAR)ppFilterList[i] + 0x50);
			PDRIVER_OBJECT pDriverObject = *(PDRIVER_OBJECT*)((PUCHAR)ppFilterList[i] + 0x68);
			RtlStringCbCopyUnicodeString(Array[i].Name, sizeof(Array[i].Name), (PUNICODE_STRING)((PUCHAR)ppFilterList[i] + 0x40));
			// 获取驱动路径
			PLDR_DATA_TABLE_ENTRY pLdr = (PLDR_DATA_TABLE_ENTRY)pDriverObject->DriverSection;
			RtlStringCbCopyW(Array[i].Path, sizeof(Array[i].Path), pLdr->FullDllName.Buffer);
			RtlStringCbCopyUnicodeString(Array[i].Altitude, sizeof(Array[i].Altitude), (PUNICODE_STRING)((PUCHAR)ppFilterList[i] + 0x50));
			Array[i].hFilter = ppFilterList[i];
			
			DbgPrint("DriverName:%wZ, hFilter:0x%p, Altitude:%wS", (PUNICODE_STRING)((PUCHAR)ppFilterList[i] + 0x40), Array[i].hFilter, Array[i].Altitude);
